run/pourali/case0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            symmetry;
    }
    right
    {
        type            symmetry;
    }
    top
    {    
        type			interfaceVelocity;
        value			uniform (0 0 0);
    }
    left
    {
        type            symmetry;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (-1 0 0);
    }
    sphere
    {
        type            noSlip;
    }    
}


// ************************************************************************* //
