run/pourali/case0/0/gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaScalarField;
    object      gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    outlet
    {
        type            zeroGradient;
        
    }
    right
    {
        type            symmetry;
    }
    left
    {
        type            symmetry;
    }
    inlet
    {
        type            fixedValue;
        value			uniform 1;
    }
    sphere
    {
        type            zeroGradient;
    }    
}


// ************************************************************************* //
